Revit 2026 API

# PointCloudInstanceSetSelectionFilter Method

---

Sets active selection filter by cloning of the one passed to it.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetSelectionFilter(
	PointCloudFilter pFilter
)
```
```vb
Public Sub SetSelectionFilter (
	pFilter As PointCloudFilter
)
```
```cpp
public:
void SetSelectionFilter(
	PointCloudFilter^ pFilter
)
```
```fsharp
member SetSelectionFilter :
        pFilter : PointCloudFilter -> unit
```

#### Parameters

pFilter PointCloudFilter
     The filter object to be made active. If  is supplied, the active filter is removed.

The filter is provided in the coordinates of the Revit model. If the point cloud is altered (e.g. by moving, rotating, scaling or other modifications) the point cloud filter is not modified and the set of highlighted or isolated points will change. The selection filter is not preserved when the Revit document is saved.

#### Reference

PointCloudInstance Class

Autodesk.Revit.DB Namespace